{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "signature": {"inputs": {"X": {"name": "X:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"accuracy_calc/prediction": {"name": "accuracy_calc/prediction:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "dropout_layer/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_1/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "1500"}]}}}}}, {"name": "layer_1/B", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1500"}]}}}}}, {"name": "dropout_layer/GreaterEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_2/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1500"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_2/B", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "layer_3/W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}}}, {"name": "layer_3/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "26"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "out/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "26"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "layer_1/MatMul", "op": "MatMul", "input": ["X", "layer_1/W"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "layer_1/add", "op": "AddV2", "input": ["layer_1/MatMul", "layer_1/B"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_1/Relu", "op": "Relu", "input": ["layer_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/Mul", "op": "Mul", "input": ["dropout_layer/Const", "layer_1/Relu"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/Shape", "op": "Shape", "input": ["layer_1/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_layer/Shape"], "attr": {"dtype": {"type": "DT_FLOAT"}, "T": {"type": "DT_INT32"}, "seed2": {"i": "0"}, "seed": {"i": "0"}}}, {"name": "dropout_layer/GreaterEqual", "op": "GreaterEqual", "input": ["dropout_layer/random_uniform/RandomUniform", "dropout_layer/GreaterEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer/Cast", "op": "Cast", "input": ["dropout_layer/GreaterEqual"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}}}, {"name": "dropout_layer/Mul_1", "op": "Mul", "input": ["dropout_layer/Mul", "dropout_layer/Cast"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "layer_2/MatMul", "op": "MatMul", "input": ["dropout_layer/Mul_1", "layer_2/W"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/add", "op": "AddV2", "input": ["layer_2/MatMul", "layer_2/B"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/Relu", "op": "Relu", "input": ["layer_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_3/MatMul", "op": "MatMul", "input": ["layer_2/Relu", "layer_3/W"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "layer_3/add", "op": "AddV2", "input": ["layer_3/MatMul", "layer_3/B"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_3/Relu", "op": "Relu", "input": ["layer_3/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out/MatMul", "op": "MatMul", "input": ["layer_3/Relu", "out/W"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "out/add", "op": "AddV2", "input": ["out/MatMul", "out/B"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "out/Softmax", "op": "Softmax", "input": ["out/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction", "op": "ArgMax", "input": ["out/Softmax", "accuracy_calc/prediction/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "dropout_layer/Const", "shape": [], "dtype": "float32"}, {"name": "layer_1/W", "shape": [784, 1500], "dtype": "float32"}, {"name": "layer_1/B", "shape": [1500], "dtype": "float32"}, {"name": "dropout_layer/GreaterEqual/y", "shape": [], "dtype": "float32"}, {"name": "layer_2/W", "shape": [1500, 512], "dtype": "float32"}, {"name": "layer_2/B", "shape": [512], "dtype": "float32"}, {"name": "layer_3/W", "shape": [512, 64], "dtype": "float32"}, {"name": "layer_3/B", "shape": [64], "dtype": "float32"}, {"name": "out/W", "shape": [64, 26], "dtype": "float32"}, {"name": "out/B", "shape": [26], "dtype": "float32"}, {"name": "accuracy_calc/prediction/dimension", "shape": [], "dtype": "int32"}]}]}